logs/fio-diskseq/hpk/003/log002.txt
+ kubectl create namespace bench
namespace/bench created
+ kubectl create -n bench -f -
pod/fio created
+ kubectl wait -n bench --for condition=Ready --timeout=3m pod/fio
error: timed out waiting for the condition on pods/fio
+ kubectl wait -n bench --for condition=Ready=False --timeout=10h pod/fio
pod/fio condition met
+ kubectl logs pod/fio -n bench
Defaulted container "fio" out of: fio, init-container-resources (init)
INFO:    Converting SIF file to temporary sandbox...
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;77170;301;108702;0;0;0.000000;0.000000;70;103733;3311.064229;7384.684186;1.000000%=96;5.000000%=98;10.000000%=100;20.000000%=104;30.000000%=108;40.000000%=112;50.000000%=128;60.000000%=164;70.000000%=189;80.000000%=8454;90.000000%=10682;95.000000%=15400;99.000000%=36962;99.500000%=44826;99.900000%=62128;99.950000%=71827;99.990000%=87556;0%=0;0%=0;0%=0;74;103737;3316.158789;7384.547555;6144;919552;99.774309%;76995.834101;92150.289223;0.180311%;4.148076%;7758;0;229;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;8.69%;67.41%;0.26%;0.01%;0.00%;0.00%;0.00%;12.87%;7.33%;3.15%;0.28%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;4377;7741;0;0;305406;208039;513445;61.34%;slaves;4346;33983;1025;3364;292904;375120;684593;97.25%;sda;4346;33983;1025;3364;292904;375120;684593;97.25%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=389: Sun Nov 26 22:38:55 2023
  write: IOPS=301, BW=75.4MiB/s (79.0MB/s)(8192MiB/108702msec); 0 zone resets
    clat (usec): min=70, max=103733, avg=3311.06, stdev=7384.68
     lat (usec): min=74, max=103737, avg=3316.16, stdev=7384.55
    clat percentiles (usec):
     |  1.00th=[   97],  5.00th=[   99], 10.00th=[  101], 20.00th=[  105],
     | 30.00th=[  109], 40.00th=[  113], 50.00th=[  129], 60.00th=[  165],
     | 70.00th=[  190], 80.00th=[ 8455], 90.00th=[10683], 95.00th=[15401],
     | 99.00th=[36963], 99.50th=[44827], 99.90th=[62129], 99.95th=[71828],
     | 99.99th=[87557]
   bw (  KiB/s): min= 6144, max=919552, per=99.77%, avg=76995.83, stdev=92150.29, samples=217
   iops        : min=   24, max= 3592, avg=300.76, stdev=359.96, samples=217
  lat (usec)   : 100=8.69%, 250=67.41%, 500=0.26%, 750=0.01%
  lat (msec)   : 10=12.87%, 20=7.33%, 50=3.15%, 100=0.28%, 250=0.01%
  cpu          : usr=0.18%, sys=4.15%, ctx=7758, majf=0, minf=229
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=75.4MiB/s (79.0MB/s), 75.4MiB/s-75.4MiB/s (79.0MB/s-79.0MB/s), io=8192MiB (8590MB), run=108702-108702msec

Disk stats (read/write):
    dm-0: ios=4377/7741, merge=0/0, ticks=305406/208039, in_queue=513445, util=61.34%, aggrios=4346/33983, aggrmerge=1025/3364, aggrticks=292904/375120, aggrin_queue=684593, aggrutil=97.25%
  sda: ios=4346/33983, merge=1025/3364, ticks=292904/375120, in_queue=684593, util=97.25%
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;251796;983;33315;0;0;0.000000;0.000000;24;590319;1015.953349;7271.188140;1.000000%=28;5.000000%=36;10.000000%=38;20.000000%=40;30.000000%=42;40.000000%=43;50.000000%=44;60.000000%=45;70.000000%=54;80.000000%=62;90.000000%=75;95.000000%=3883;99.000000%=17170;99.500000%=40108;99.900000%=92798;99.950000%=124256;99.990000%=235929;0%=0;0%=0;0%=0;24;590319;1016.016470;7271.188837;2048;487424;99.602324%;250794.666667;176232.283022;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.147085%;8.627004%;5384;0;217;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;67.47%;23.41%;0.09%;0.09%;0.06%;0.04%;1.97%;2.08%;2.43%;1.65%;0.35%;0.30%;0.06%;0.01%;0.01%;0.00%;0.00%;0.00%;dm-0;14251;501;0;0;783265;51399;834664;92.29%;slaves;47749;2678;961;14;2092334;66742;2162653;97.54%;sda;47749;2678;961;14;2092334;66742;2162653;97.54%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=447: Sun Nov 26 22:39:29 2023
  read: IOPS=983, BW=246MiB/s (258MB/s)(8192MiB/33315msec)
    clat (usec): min=24, max=590319, avg=1015.95, stdev=7271.19
     lat (usec): min=24, max=590319, avg=1016.02, stdev=7271.19
    clat percentiles (usec):
     |  1.00th=[    29],  5.00th=[    37], 10.00th=[    39], 20.00th=[    41],
     | 30.00th=[    43], 40.00th=[    44], 50.00th=[    45], 60.00th=[    46],
     | 70.00th=[    55], 80.00th=[    63], 90.00th=[    76], 95.00th=[  3884],
     | 99.00th=[ 17171], 99.50th=[ 40109], 99.90th=[ 92799], 99.95th=[124257],
     | 99.99th=[235930]
   bw (  KiB/s): min= 2048, max=487424, per=99.60%, avg=250794.67, stdev=176232.28, samples=66
   iops        : min=    8, max= 1904, avg=979.67, stdev=688.41, samples=66
  lat (usec)   : 50=67.47%, 100=23.41%, 250=0.09%, 500=0.09%, 750=0.06%
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=1.97%, 4=2.08%, 10=2.43%, 20=1.65%, 50=0.35%
  lat (msec)   : 100=0.30%, 250=0.06%, 500=0.01%, 750=0.01%
  cpu          : usr=0.15%, sys=8.63%, ctx=5384, majf=0, minf=217
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=246MiB/s (258MB/s), 246MiB/s-246MiB/s (258MB/s-258MB/s), io=8192MiB (8590MB), run=33315-33315msec

Disk stats (read/write):
    dm-0: ios=14251/501, merge=0/0, ticks=783265/51399, in_queue=834664, util=92.29%, aggrios=47749/2678, aggrmerge=961/14, aggrticks=2092334/66742, aggrin_queue=2162653, aggrutil=97.54%
  sda: ios=47749/2678, merge=961/14, ticks=2092334/66742, in_queue=2162653, util=97.54%
INFO:    Cleaning up image...
+ kubectl delete namespace bench
namespace "bench" deleted